In [2]:
import pandas as pd

In [24]:
df = pd.read_csv("DataAnalyst.csv")

### Menampilkan panjang record data

In [26]:
df.shape

(2253, 16)

### Mengecek null atribut

In [32]:
df.isna().sum()

Unnamed: 0           0
Job Title            0
Salary Estimate      0
Job Description      0
Rating               0
Company Name         1
Location             0
Headquarters         0
Size                 0
Founded              0
Type of ownership    0
Industry             0
Sector               0
Revenue              0
Competitors          0
Easy Apply           0
dtype: int64

### Informasi yang didapatkan adalah jumlah record, nama attribute, jumlah attribute dengan tipe objek, jumlah attribute dengan tipe angka, jumlah attribute yang memiliki nilai null.

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2253 entries, 0 to 2252
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         2253 non-null   int64
 1   Job Title          2253 non-null   object
 2   Salary Estimate    2253 non-null   object
 3   Job Description    2253 non-null   object
 4   Rating             2253 non-null   float64
 5   Company Name       2252 non-null   object
 6   Location           2253 non-null   object
 7   Headquarters       2253 non-null   object
 8   Size               2253 non-null   object
 9   Founded            2253 non-null   int64
 10  Type of ownership  2253 non-null   object
 11  Industry           2253 non-null   object
 12  Sector             2253 non-null   object
 13  Revenue            2253 non-null   object
 14  Competitors        2253 non-null   object
 15  Easy Apply         2253 non-null   object
dtypes: float64(1), int64(2), object(13)
memory usage: 281.8+ KB

### Masukkan informasi di atas dalam dictionary dengan key sesuai nama informasinya. Tampilkan isi dari dictionary tersebut sebagus mungkin.

In [27]:
record = RangeIndex.to_dict["record"]
nama_atribut = df["column"].to_dict["nama_atribut"]
atribut_object = dtypes.to_dict["release_year"]
for i in record:
    record
for i in nama_atribut:
    nama_atribut
    

    data={
"jumlah record":df.size, 
"nama atribute":df.columns,
"jumlah atribute dengan tipe object" :
[len(df.select_dtypes(['object']).columns)], 
"jumlah atribute dengan tipe angka" :[len(df.select_dtypes(['float64','int64']).columns)], 
"jumlah atribute memiliki nilai nul":[len(df.loc[:, df.isna().any()].columns)] } 

print("======================================================================") 

print("|                healthcare_dataset_stroke_data                      |")
print("|                           Posttest 2                               |") 

print("======================================================================") 
print('1. Jumlah Record pada DATASET :', data.get('jumlah record')) 

print("======================================================================") 
print('2. Nama Atribute pada DATASET :') 

for i in range (len(data["nama atribute"])):
    print(data["nama atribute"][i])
    i+=1
print("======================================================================") 

print('jumlah atribute dengan tipe object:', data.get('jumlah atribute dengan tipe object'))
print("======================================================================") 

print('jumlah atribute dengan tipe angka:', data.get('jumlah atribute dengan tipe angka'))
print("======================================================================")
print('jumlah atribute memiliki nilai nul :', data.get('jumlah atribute memiliki nilai nul')) 
print("======================================================================")

NameError: name 'RangeIndex' is not defined

### Tampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

In [28]:
df.describe()

       Unnamed: 0       Rating      Founded
count   2253.0000  2253.000000  2253.000000
mean    1126.0000     3.160630  1398.522858
std      650.5294     1.665228   901.929251
min        0.0000    -1.000000    -1.000000
25%      563.0000     3.100000    -1.000000
50%     1126.0000     3.600000  1979.000000
75%     1689.0000     4.000000  2002.000000
max     2252.0000     5.000000  2019.000000

### Tampilkan nilai korelasi attribute bertipe angka.

In [35]:
df.corr()

            Unnamed: 0    Rating   Founded
Unnamed: 0    1.000000  0.041737  0.052124
Rating        0.041737  1.000000  0.460519
Founded       0.052124  0.460519  1.000000

### Rubah nilai salah satu attribute bertipe angka menjadi desimal 3 angka dibelakang koma jika tidak ada, lakukan sebaliknya (dari desimal menjadi bilangan bulat).

In [48]:
df["Rating"] = df["Rating"].astype("float64")
df.select_dtypes(include=["int64", "float64"]).applymap("{:.3f}".format, "ignore")

     Unnamed: 0  Rating   Founded
0         0.000   3.000  1961.000
1         1.000   3.000  1893.000
2         2.000   3.000  2003.000
3         3.000   4.000  2002.000
4         4.000   3.000  2009.000
...         ...     ...       ...
2248   2248.000   2.000    -1.000
2249   2249.000   2.000  1935.000
2250   2250.000  -1.000    -1.000
2251   2251.000   3.000  1984.000
2252   2252.000   3.000  1864.000

[2253 rows x 3 columns]

### Tampilkan 10 record pertama dari attribute bertipe angka.

In [44]:
df[["Founded"]].head(10)

   Founded
0     1961
1     1893
2     2003
3     2002
4     2009
5     2014
6     2001
7     1914
8     1896
9     2013

### Simpan dataset dengan attribute bertipe angka ke dalam file CSV.

In [50]:
df.select_dtypes(include=["int64", "float64"]).to_csv("Atribute_angka.csv")